{
    "item_id": 0,
    "item_type": "这里输入商品类型,string格式,比如mouse,keyboard,monitor,headphone,etc",
    "name": "这里输入商品名称,string格式",
    "price": 100,
    "image_id": "这里输入商品图片的id,对应所上传的图片的名称",
    "description": "这里输入商品描述，可以输入商品的详细信息，比如商品的材质, 尺寸,颜色,产地,品牌,等等,最好长一些,生成至少150字"
}
{
    "item_id": 48293,
    "item_type": "hard drive",
    "name": "Sleek Portable Hard Drive",
    "price": 299.99,
    "image_id": "Hard Drive_1.webp",
    "description": "This sleek portable hard drive is designed for those who need to take large amounts of data on the go. Encased in a brushed aluminum shell, it offers both durability and a sophisticated look. With a USB 3.0 interface, it ensures high-speed data transfer, making it ideal for backing up important files quickly. The compact design allows it to fit easily into any bag or pocket, making it perfect for travel. Its shockproof technology protects your data from accidental drops and bumps. Compatible with both Windows and Mac systems, it offers versatility for different users. This hard drive is an essential tool for photographers, videographers, and anyone needing reliable storage."
}
{
    "item_id": 74638,
    "item_type": "hard drive",
    "name": "Industrial External Hard Drive",
    "price": 349.99,
    "image_id": "Hard Drive_2.jpg",
    "description": "The Industrial External Hard Drive is engineered for robust performance and durability, ideal for demanding environments. Its rugged metal casing provides excellent protection against dust and physical impact, ensuring your data remains secure. Featuring a high-speed USB 3.0 connection, it facilitates fast data transfers, making it perfect for large files and complex projects. The design includes reinforced corners and a sturdy cable connection to withstand heavy use. This hard drive is compatible with both Windows and Mac systems, offering versatility across different platforms. With its sleek industrial look, it not only performs well but also adds a professional touch to your setup. Suitable for engineers, designers, and professionals requiring reliable data storage on-the-go, this drive meets the highest standards of quality and resilience."
}
{
    "item_id": 58247,
    "item_type": "hard drive",
    "name": "Sleek Silver External Hard Drive",
    "price": 279.99,
    "image_id": "Hard Drive_3.webp",
    "description": "The Sleek Silver External Hard Drive is a stylish and efficient storage solution for modern users. Encased in a sleek silver aluminum body, it is both lightweight and durable, offering excellent protection for your valuable data. The drive features a unique textured surface for enhanced grip and aesthetic appeal. Equipped with dual USB 3.0 ports, it ensures fast data transfers, making it ideal for handling large files such as videos and high-resolution images. Its slim design allows for easy portability, fitting comfortably in any bag or pocket. This hard drive is compatible with both Windows and Mac operating systems, providing versatility and ease of use. The LED indicator adds a touch of modernity, displaying power and activity status. Perfect for students, professionals, and anyone in need of reliable, mobile storage."
}
{
    "item_id": 91457,
    "item_type": "hard drive",
    "name": "Futuristic Dual-Port Hard Drive",
    "price": 329.99,
    "image_id": "Hard Drive_4.png",
    "description": "The Futuristic Dual-Port Hard Drive offers a cutting-edge design and exceptional performance for tech-savvy users. Encased in a sleek, matte black finish, this hard drive combines aesthetics with functionality. It features an innovative cooling mechanism at the center, highlighted by an LED-lit ring, ensuring optimal performance during extended usage. Equipped with dual USB 3.1 ports, it supports high-speed data transfers, making it ideal for large multimedia files and backups. Its robust build ensures durability while maintaining a lightweight profile for easy portability. Compatible with both Windows and Mac systems, it caters to a wide range of users. This hard drive is perfect for creative professionals and tech enthusiasts looking for a reliable, stylish storage solution."
}
{
    "item_id": 67342,
    "item_type": "hard drive",
    "name": "Classic Portable Hard Drive",
    "price": 259.99,
    "image_id": "Hard Drive_5.jpg",
    "description": "The Classic Portable Hard Drive delivers reliable storage in a timeless design. Featuring a sturdy black casing, it provides excellent protection for your data while maintaining a sleek appearance. The hard drive is equipped with multiple ports, including USB and eSATA, offering versatile connectivity options for fast data transfers. Its compact design ensures it fits easily into any travel bag, making it an ideal companion for on-the-go storage needs. Compatible with both Windows and Mac operating systems, it offers flexibility for various users. The durable build ensures longevity, while the matte finish resists fingerprints and scratches. Perfect for students, professionals, or anyone requiring dependable storage, this hard drive combines functionality with classic style."
}
