{
  "products": [
    {
      "item_id": 1,
      "item_type": "thermos",
      "name": "Premium Stainless Steel Thermos",
      "price": 49.90,
      "image_id": "thermos_01",
      "description": "This premium stainless steel thermos features advanced double-wall vacuum insulation technology, maintaining your beverages at the perfect temperature for up to 24 hours hot or 36 hours cold. Crafted from high-grade 18/8 stainless steel, it's both durable and resistant to rust and corrosion. The leak-proof lid doubles as a convenient drinking cup, while the ergonomic design ensures comfortable handling. With a 500ml capacity, it's perfect for daily use, whether at the office, during outdoor activities, or on your daily commute. The sleek brushed steel finish not only looks professional but also provides excellent grip. Features include a wide mouth for easy cleaning and filling, compatibility with most cup holders, and a built-in tea filter for loose leaf brewing. BPA-free and eco-friendly, this thermos comes with a 5-year warranty against manufacturing defects."
    },
    {
      "item_id": 2,
      "item_type": "watch",
      "name": "Vintage Mechanical Watch",
      "price": 69.90,
      "image_id": "watch_01",
      "description": "This exquisite vintage-style mechanical watch combines classic aesthetics with modern reliability. Featuring a precise Japanese automatic movement, this timepiece offers exceptional accuracy without the need for batteries. The 40mm case is crafted from 316L stainless steel, offering excellent durability while maintaining a sophisticated appearance. The sapphire crystal face provides superior scratch resistance, while the exhibition case back allows you to admire the intricate mechanical movement. The genuine leather strap is hand-stitched and ages beautifully with wear. Water-resistant to 50 meters, this watch features luminous hands and markers for easy reading in low-light conditions. The minimalist dial design includes Roman numerals and a date window at 3 o'clock. Perfect for both formal occasions and daily wear, this watch comes in a luxury presentation box with a cleaning cloth and adjustment tool. Each piece undergoes strict quality control and comes with a 2-year international warranty."
    },
    {
      "item_id": 3,
      "item_type": "speaker",
      "name": "Portable Bluetooth Speaker",
      "price": 39.90,
      "image_id": "speaker_01",
      "description": "Experience premium sound quality with this compact yet powerful Bluetooth speaker. Equipped with dual 10W drivers and passive bass radiators, it delivers rich, clear audio with deep bass response. The latest Bluetooth 5.0 technology ensures stable connectivity up to 100 feet and seamless pairing with all your devices. With an IPX7 waterproof rating, it's perfect for outdoor activities, whether at the beach, by the pool, or during camping trips. The built-in 4000mAh rechargeable battery provides up to 24 hours of continuous playback at moderate volume. Features include a built-in microphone for hands-free calls, voice assistant compatibility, and True Wireless Stereo function allowing you to pair two speakers for enhanced stereo sound. The durable fabric covering and rubberized housing protect against drops and impacts. Multiple connectivity options include Bluetooth, AUX-in, and SD card support. The speaker also features intuitive touch controls and LED indicators for easy operation."
    },
    {
      "item_id": 4,
      "item_type": "notebook",
      "name": "Smart Digital Notebook",
      "price": 89.90,
      "image_id": "notebook_01",
      "description": "Revolutionize your note-taking experience with this innovative smart digital notebook. Featuring advanced E-ink technology and a paper-like surface, it provides the natural feel of traditional writing with the convenience of digital storage. The 10.3-inch anti-glare display offers excellent visibility in any lighting condition and reduces eye strain during extended use. With 32GB of internal storage, you can save thousands of pages of notes, which can be easily organized into folders and tagged for quick retrieval. The notebook supports multiple file formats including PDF, EPUB, and PNG, allowing you to annotate documents and export your notes to various platforms. The precision stylus offers 4096 levels of pressure sensitivity for natural writing and sketching. Built-in OCR technology converts your handwritten notes to searchable text, while cloud synchronization ensures your work is always backed up. The device features a sleek aluminum body, weighs only 420g, and offers up to 3 weeks of battery life with typical use. Perfect for students, professionals, and creative individuals."
    }
  ]
} 